w04/d05/Zach_Brady/movietrailer/movietrailer_app/app/views/trailers/index.html.erb

<h1>Movie Trailers for <%=Movie.find_by(id: params[:movie_id]).title %></h1>
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1