w04/d05/Zach_Brady/movietrailer/movietrailer_app/app/controllers/characters_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'The Terminator' LIMIT 1
---
  def update
    @character = Character.find(params[:id])
    @character.update({
      name: params[:name],
      photo_url: params[:photo_url],
      movie_id: Movie.find_by(title: params[:movie]).id
      })