w04/d05/Zach_Brady/movietrailer/movietrailer_app/app/controllers/characters_controller.rb

  def index
    @characters = Character.where(movie_id: params[:movie_id].to_i)
---
SELECT "characters".* FROM "characters" WHERE "characters"."movie_id" = 3

  def show
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", "character"]]

  def create
    Character.create( {
      name: params[:name],
      photo_url: params[:photo_url],
      movie_id: params[:movie_id]
      } )
---
INSERT INTO "characters" ("movie_id", "name", "photo_url") VALUES ($1, $2, $3) RETURNING "id"  [["movie_id", 3], ["name", "Kyle Reese"], ["photo_url", "http://static1.wikia.nocookie.net/__cb20130203025902/terminator/images/8/8d/Kyle_Reeseh.jpg"]]

  def edit
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", "8"]]

  def update
    @character = Character.find(params[:id])
    @character.update({
      name: params[:name],
      photo_url: params[:photo_url],
      movie_id: Movie.find_by(name: params[:movie]).id
      })
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", "8"]]
SELECT "movies".* FROM "movies" WHERE "movies"."name" = 'The Terminator' LIMIT 1
UPDATE "characters" SET "name" = $1 WHERE "characters"."id" = 8  [["name", "Kyle Rease"]]