w04/d05/Zach_Brady/movietrailer/movietrailer_app/app/controllers/movies_controller.rb

  def create
    Movie.create( {
      title: params[:title],
      year: params[:year],
      poster_url: params[:poster_url]
      } )
---
INSERT INTO "movies" ("poster_url", "title", "year") VALUES ($1, $2, $3) RETURNING "id"  [["poster_url", "a"], ["title", "a"], ["year", 0]]

  def update
    @movie = Movie.find(params[:id])
    @movie.update({
      title: params[:title],
      year: params[:year],
      poster_url: params[:poster_url],
      })
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "poster_url" = $1 WHERE "movies"."id" = 1  [["poster_url", "http://cf.badassdigest.com/_uploads/images/26676/the_master_turkish_poster_color_high__span.jpg"]]