w04/d05/Zach_Brady/movietrailer/movietrailer_app/app/controllers/trailers_controller.rb

  def index
    @trailers = Trailer.all
---
SELECT "trailers".* FROM "trailers" WHERE "trailers"."movie_id" = 3