w04/d05/Zach_Brady/movietrailer/movietrailer_app/app/views/characters/edit.html.erb

    Movie
    <input type="text" name="movie" value="<%=Movie.find_by(id: params[:movie_id]).title%>"/>
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 3 LIMIT 1